tap "homebrew/bundle"
brew "bat"
brew "docker-compose"
brew "fzf"
brew "python@3.11"
brew "python@3.13"
brew "speedtest-cli"
brew "thefuck"
cask "bitwarden"
cask "discord"
cask "docker"
cask "ghostty"
cask "google-chrome"
cask "handbrake"
cask "hiddenbar"
cask "macdown"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "netspot"
cask "omnidisksweeper"
cask "orion"
cask "postman"
cask "qbittorrent"
cask "slack"
cask "visual-studio-code"
cask "vmware-fusion"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "batisteo.vscode-django"
vscode "charliermarsh.ruff"
vscode "ecmel.vscode-html-css"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
