tap "homebrew/bundle"
brew "bat"
brew "docker-compose"
brew "fzf"
brew "python@3.11"
brew "speedtest-cli"
brew "thefuck"
brew "tmux"
brew "wakeonlan"
cask "discord"
cask "docker"
cask "ghostty"
cask "google-chrome"
cask "handbrake"
cask "macdown"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "netspot"
cask "omnidisksweeper"
cask "orion"
cask "postman"
cask "qbittorrent"
cask "slack"
cask "zoom"
