tap "homebrew/bundle"
# Text-based UI library
brew "ncurses"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Isolated development environments using Docker
brew "docker-compose"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Utility that provides fast incremental file transfer
brew "rsync"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Sends audio from computer to outputs
cask "airfoil"
# Application uninstaller
cask "appcleaner"
# Desktop password and login vault
cask "bitwarden"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake-app"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source Markdown editor
cask "macdown"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# VPN client
cask "mullvad-vpn"
# WiFi site survey software and WiFi scanner
cask "netspot"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# WebKit based web browser
cask "orion"
# Emoji picker optimised for blind people
cask "rocket"
# Team communication and collaboration software
cask "slack"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# RSS and Atom reader
cask "vienna"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark-app"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "batisteo.vscode-django"
vscode "charliermarsh.ruff"
vscode "docker.docker"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "njpwerner.autodocstring"
vscode "platformio.platformio-ide"
vscode "redhat.vscode-yaml"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "vscode-icons-team.vscode-icons"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
